---
kind: method
id: M:Autodesk.Revit.DB.LeaderArray.Clear
source: html/3d85968c-3b73-0fe4-8ff8-ffedf05bf723.htm
---
# Autodesk.Revit.DB.LeaderArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```